# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [3]:
url1 = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv'
url2 = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv'

cars1 = pd.read_csv(url1)
cars2 = pd.read_csv(url2)

print(cars1.head())
print(cars2.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [4]:
cars1 = cars1.loc[:, "mpg":"car"]
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [8]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [9]:
cars = cars1.append(cars2)
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [10]:
owners = np.random.randint(15000, high=73001, size=398, dtype='l')
owners

array([26616, 30201, 27400, 69733, 52358, 61332, 39943, 68449, 39624,
       42181, 63649, 44745, 15981, 46015, 67053, 29534, 34814, 47171,
       20875, 29689, 64088, 30923, 29854, 43751, 53784, 65705, 44100,
       36164, 50942, 29491, 54919, 35119, 72333, 66318, 61984, 50274,
       51350, 64706, 45310, 48107, 35598, 70420, 60923, 50873, 57082,
       23649, 69132, 47266, 31686, 50666, 60970, 20234, 31964, 18622,
       54611, 24033, 25497, 69927, 64287, 38723, 58351, 19106, 60035,
       72349, 58588, 48706, 28386, 24813, 55588, 66395, 69616, 18103,
       48199, 52963, 44326, 59853, 44920, 18024, 28875, 72653, 62175,
       26186, 41532, 24058, 33700, 46873, 60640, 44299, 48663, 71157,
       28892, 48951, 41503, 52815, 49387, 61468, 54790, 64623, 21805,
       66217, 56079, 66270, 46740, 42874, 50032, 36320, 56746, 41155,
       36238, 40977, 65425, 43366, 44868, 33261, 63438, 61340, 24518,
       54423, 56179, 59338, 17556, 71281, 31174, 32307, 23642, 62094,
       52920, 19453, 64970, 71983, 26033, 18583, 46836, 34301, 37035,
       44065, 34542, 60936, 57491, 16680, 70970, 54684, 41651, 69945,
       60405, 37192, 24847, 37297, 70805, 71294, 30174, 66552, 48272,
       50513, 37507, 15493, 38034, 53390, 41143, 40427, 27789, 56599,
       58618, 27501, 55014, 32753, 67221, 72169, 32023, 61235, 62524,
       41543, 63050, 41579, 52215, 66095, 64669, 40895, 18558, 69730,
       46973, 53995, 38356, 19396, 70987, 17619, 57413, 56978, 56746,
       36730, 65477, 28208, 54618, 39844, 58180, 20145, 66507, 27881,
       42754, 68511, 48618, 48770, 17329, 69504, 62033, 20687, 22624,
       19082, 60311, 32092, 29474, 66286, 71010, 51403, 35538, 47259,
       33272, 65489, 54647, 43971, 21584, 43253, 39697, 24467, 51252,
       32720, 47953, 53557, 65229, 34122, 40135, 63475, 26072, 37901,
       15593, 57624, 47901, 65898, 40954, 29373, 56253, 42123, 50505,
       38186, 52153, 46866, 68480, 39280, 42787, 32384, 56508, 69007,
       20968, 64532, 61002, 45701, 45038, 17805, 67600, 44272, 42817,
       69571, 54620, 50851, 72462, 38409, 50034, 32400, 38793, 39059,
       26180, 59049, 33946, 43258, 48961, 41501, 38293, 23188, 15581,
       29414, 53685, 28405, 17631, 31384, 55935, 55268, 60017, 48001,
       51569, 68842, 37074, 66689, 37359, 25832, 24992, 59585, 66617,
       17691, 62910, 70676, 39409, 28106, 61201, 15971, 72960, 45155,
       63942, 23267, 51779, 27684, 65710, 44941, 71664, 52250, 65201,
       34142, 27475, 72681, 68503, 68338, 29429, 19706, 16777, 15700,
       68607, 62975, 68636, 34893, 25111, 16275, 51031, 50918, 71032,
       47553, 21246, 72656, 38584, 62344, 48219, 62837, 67373, 68688,
       35412, 43844, 69797, 59740, 16489, 21824, 64155, 62080, 41392,
       56136, 21807, 66757, 34796, 61607, 27142, 35860, 31651, 15643,
       57879, 68348, 40258, 25377, 61946, 15153, 44313, 20803, 25491,
       30503, 48100, 59929, 33270, 31124, 61200, 61548, 72626, 61336,
       33006, 49689, 27567, 59751, 42273, 27712, 34239, 34185, 60066,
       56760, 58974, 45605, 45072, 31053, 30873, 52068, 29679, 16846,
       59975, 63206])

### Step 8. Add the column owners to cars

In [11]:
cars['owners'] = owners
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,26616
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,30201
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,27400
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,69733
4,17.0,8,302,140,3449,10.5,70,1,ford torino,52358